wart> ^D

wart> 1<Enter>
      <Enter>
1
wart> ^D

wart> def foo()<Enter>
        34<Enter>
      <Enter>

Manually load a .wart file at the repl.

Add a comment at the end of one of the .wart files.
$ wart test

Add a comment at the prompt.
wart> (prn "world") # this is a comment!<Enter>
      <Enter>

Multiple lines at the prompt:
wart> 34<Enter>
      (prn "hi")<Enter>
34
      <Enter>
hi
"hi"
wart>

Two expressions on a single line:
wart> () 34<Enter>
      <Enter>
nil
34
wart>

Comment on the first line:
wart> # skip
      34<Enter>
nil
      <Enter>
34
wart>
