I.
wart> 34<enter>
=> 34
wart>

II.
wart> (1 + 1)<enter>
=> 2
wart>

III.
wart> + 1 1<enter>
      <enter>
=> 2
wart>

IV.
wart> def (foo)<enter>
        34<enter>
      <enter>
=> (object function ...)
wart>

V.
wart> (def (foo)<enter>
        34)<enter>
=> (object function ...)
wart>

VI.
wart> <enter>
      34<enter>
=> 34
wart>

VII.
wart> () (+ 1 1)<enter>
=> nil
=> 2
wart>

VIII.
wart> () (def (foo)<enter>
=> nil
        34)<enter>
=> (object function ...)
wart>
